[
  {
    "id": 2,
    "date": "6/23/2023",
    "title": "公開",
    "content": "　ついに自分も電脳世界で一国一城となったわけだ、完成まで2年ぐらいかかってしまったのでとても感慨深い。どうしてこうも時間がかかったのかというとひとえに自分の怠惰が原因であるのだが。とりあえず軽くページ案内をさせていただきたい、これはトップページでやるべきことではないのか？という点についてはひとまず置いておく。書いておけば後々流用もできるだろう。<br><br>　まずはトップページだが自己紹介とツイッター、及び更新情報が設置してある。現在は以前貰ったイラストを許可を得たうえで設置してあるがそのうち自画像にでも差し替える予定だ。ツイッターは処理の関係でロードが終わる前にページに表示されるのが気に食わないが穴埋めとしては上出来だろう。ツイッター事態に対する好感度が近年ガンガン下がっているのでそのうち消えるかもしれないが。更新情報についてはまさに文字通り更新情報を乗せているだけ。RSSを実装しようかと考えもしたが自分で使ったことがないのもあって気が乗らなかったので未実装だ、もし誰かが要求したら追加する。<br><br>　BMSページは自作のBMSがコメントと一緒に紹介されている。ジャケットをクリックすると実装が一番面倒だったモーダルウインドウに情報が表示される仕組みだ。音を流そうと考えもしたが自分がそういうのっでびっくりするタイプなので一旦保留している。また左上のDLリンクでは一括でダウンロードも可能なのでクリック回数を減らしてBMSだけ手に入れたいに人にも親切な仕組みになっていると思う。Sky Skimmingは合作相手の許可が取れていないので未追加、RSE四天王と浪漫電脳進行系は著作権が怖いのでないがそのうちこっそり追加すると思う。<br><br>　差分ページは自作差分が全て難易度表形式で管理されている。旧ブログと比べると情報量が減ったがサッパリしたので一長一短か。https://ctconnected.net/sabun と入力することでGLAssistにも対応している<br><br>　そしてこのブログページだがいたって普通のブログだ。コメント欄を設置していないのはセキュリティ的な観点から自分が管理できるとは到底思っていないことが理由。安全な実装自体はCloudflareなどを使えば容易だが、結構な金がかかるうえに旧ブログでもあまりコメントをもらった記憶がないので不要と断じた。<br><br>　ツールページは作ったはいいものの大したものもないしスペース埋めぐらいしか出来ていない気がする。<br><br>　そして最後にリンク集、こちらもナビゲーションバーの情報量増やすぐらいにしかなってない気がする。もしバナーとかあったら追加したいのだがこの現代サイトバナーを持っている人間などほぼいないと思われる。かくいう自分も持っていない。<br><br>　サイトについては大まかにこんな感じだろうか。使われているテクノロジーなども説明したかったが思ったよりも長くなってしまったのでまたの機会にする。",
    "tags":[
      "閑話"
    ]
  },
  {
    "id": 1,
    "date": "6/19/2023",
    "title": "動機",
    "content": "　日々を生きているとふと任意の概念に対してつらつらと長文を書き連ねたくなることがある。例えば調理中トマトを切る際、あらゆる包丁研ぎ機の通販でトマトが切られていることについてとか。 そういったアイデアが浮かんでは消え浮かんでは消えているのだが、それらを出力してみたくなったのだ。脳内ではそれらのトピックについて無限に続けられるように思えるのだが、実際に文字に起こした場合どれくらい文章を連ねられるかという問いに対する答えが欲しいというのもある。<br><br>　そういった乱雑な書き連ね以外の記事としては趣味であるゲームに関する攻略や雑談といったトピックが主となるか。ツイッターなどではBMS関連のフォロワーがほとんどであることから、それ以外のゲームの話題は割と控えめにしがちであるのでその捌け口としても利用していきたいと思う。読んだ本や見た映画について語るのもありかもしれない。ネタバレを嫌悪する類の人間なので自分からネタバレを発することもしないように試みているのだが、その結果感想などをシェアする機会があまりない。ブログならネタバレ除けも設置しやすいであろうしいい案かもしれない。<br><br>　また別の理由として自分の日本語で長文を能力を少しでも鍛えたかったということもある。自分は現代人らしくSNS中毒に陥っており、140文字以上の文章を書いた覚えがさらさらない。英語でなら日々つけている日記や、それでこそ仕事や大学では各種課題やプロジェクト、論文でかしこまった文章を書き連ねていたため経験があるが、日本語での文章に関してはさっぱりだ。インターネットの良くない部分に入り浸っていたため語彙や文の構成などといった能力にも乏しいのでそれらを改善したい。<br><br>　ただしブログを書くといっても自分は自身の感情や意見を公開することに関して酷く臆病なため、おそらくひどくどうでもいい話しかしないように試みるであろう。というわけで自身のブログを暮狛閑話と名づけることとした。閑話休題してまた閑話。願わくば三日坊主にならないことを祈るが、ならなかったところで更新頻度には期待できないであろう。",
    "tags":[
      "閑話"
    ]
  }
]
