[
  {
    "id": 7,
    "date": "05/09/2024",
    "title": "パクチーの流行る理由がわからない",
    "content": "　しばらく前にもう終わった話だと思われるが、ツイッターを見る限りパクチーが日本でブームになっていた時期があったらしい。<br>それが全く理解できないのだ。まず大前提として自分はパクチーがそこそこ好きである、理解できないといってもパクチーがまずいと感じるとかそういう主観的なものではなくもう少し客観的な理屈に基づいて納得がいっていない。<br><br>　パクチー、英語ではコリアンダーと呼ばれており……コリアンダー！？シラントロとコリアンダーって同一の植物なんですね！？今記事を書くために事実を確認してて初めて知りました。<br>コリアンダーは一般的にスパイスとしてのみ認識しており二つの食品が実は同じ植物由来だとは全く思ってませんでした。<br>とりあえずこの記事ではこの植物の葉と茎をパクチー＝シラントロとして定義させていただきます。<br><br>　閑話休題、パクチーは植物らしい青臭さと独特の苦みが目立つ風味を持っており、料理に爽やかなアクセントを加えてくれるため脂っこい肉料理やこってりとしたソースが絡む料理などに合わせられる事が多い<br>。特にタコスなどでは鼻にツーンと来るサルサとの合わせ技でギトギトした肉のイヤな後味をサッパリと洗い流してくれる。<br>他にも脂っこい料理なら雑に上にパクチーを乗せるだけで後味がよくなり栄養素も改善してるように見えるので日常の料理に欠かせない食材。<br>つまり何が言いたいかというとパクチーはあまりにありふれており、わざわざブームになるような特別感を全く感じられないのだ。<br>そのうえパクチーという野菜はその汎用性もあって非常に安い。品種改良もされ続けており非常に育てやすくパクチーが流行ったからといって大幅に得する人々がいないのだ。<br><br>　ここまで書いて気付いたのだが、ブームになる理由しか存在していなかった。<br>長ネギほどの汎用性の安価に手に入る野菜兼ハーブが日本では一切未開拓なのだ。<br>人々に喧伝さえすれば試すだろうし販路もすでに世界中に跨っているから日本を販路に加えるくらいなんでもない。<br>そしてパクチー自体は安価でもパクチー付与の食品は数十円上乗せして売れるだろうからこれに乗らない商売人はいない。<br>よく考えたら当たり前の流行だった、ちなみにこの記事は5年近く温めていたため現在パクチーの話をする人間はほぼいない、完全に出遅れている。",
    "tags": [
      "閑話"
    ]
  },
  {
    "id": 6,
    "date": "10/16/2023",
    "title": "幼天気の終わり",
    "content": "<blockquote>実を言うと天気はもうだめです。突然こんなこと言ってごめんね。<br>でも本当です。２、３日後にものすごく赤い武人が来ます。<br>それが終わりの合図です。程なく強めの追加が来るので気をつけて。<br>それが引かれたら、少しだけ間をおいて終わりがきます。<br></blockquote>　上の文章に我々のクラス世界の天気は全く関係ない。ここ一年ぐらいBMS以外にも遊戯王MDに恐ろしくドはまりしており、その中の天気という名称を持つカード群の話だ。<br>現代の遊戯王は基本的に共通した名称のパーツを持つカードをテーマとして扱い、その共通ワードを軸としたデザイナーズコンボを押し付け合いやりたい動きを通せたら勝ちというゲーム性となっている。<br>この天気というテーマは盤面に置いてあるモンスターに隣接する罠や魔法やモンスター通して効果を付与し、一時的に除外されることをコストにその付与された効果で相手に妨害を仕掛けたり自身の得となる行動を繰り返すデッキタイプだ。<br>そんな天気デッキなのだが「一時的に除外されることをコストに」効果を得るという点が非常に特徴的な点だ。<br>いくつかの付与される効果はいつでも発動できるものであり、それを用いて相手の妨害を避けたり自分の妨害に巻き込まれないよう、まるで踊るように動き回りつつアドバンテージを稼ぐという他のデッキではほとんど見られない回し方をする。<br>特にその時フィールド上にいるすべてのモンスターの効果を無効にする《スキルドレイン》というカードとは非常に相性がよく相手が貼ってくれた時などは思わずガッツポーズが出てしまうくらいだ。<br><br>　そんな天気デッキなのだが正直なところ強さの方はそこまででもない。現代遊戯王では主にモンスターの効果を通して妨害を得るのだが天気はテーマ内でその妨害を得るための要求値が非常に高いのだ。<br>まず上記の通り「罠や魔法やモンスター通して効果を付与」するため何らかの効果を発動するためには必ず2枚のカードが必要となる。<br>多くの他のデッキの妨害は1枚で完結するためこれだけでもデッキに不純物が増えることで手札の事故率が上がる問題点があるわけだ。<br>特に後攻などで罠を引いた場合はターン内の手数が減ってしまい、1ターンに一度発動できる妨害が非常に多い遊戯王では致命傷になってしまう。<br>また遊戯王には様々な妨害があるが天気は非常に限られた3枚の組み合わせを用意できなかった場合、限定的な妨害を1か2ぐらいしか構えられないという問題点がある。<br>その3枚を揃えれさえすれば極上の妨害を3回かましたうえで次のターンに妨害数を4か5まで上げることもできるのだがそううまいこと欲しい組み合わせを引けるわけでもない。<br><br>　そんな天気デッキだが今までは何とか手を変え品を変え環境デッキと呼ばれる強いテーマたちと戦い、ゲーム内の最高ランクへ至るくらいのパワーは持っていた。<br>しかしこの度ついに最初の最終兵器彼女の改変文で言うところの赤い武人、クシャトリラのカードがすべて追加されてしまったのだ。<br>クシャトリラ自体は相手のデッキを裏側で除外して二度と使えないようにすることに特化したデッキであるがその追加カードに《クシャトリラ・アライズハート》というモンスターがいる。そいつの効果を見てみよう。<br><blockquote>「クシャトリラ・アライズハート」は、「クシャトリラ・シャングリラ」が効果を発動したターンに１度、<br>自分の「クシャトリラ」モンスターの上に重ねてＸ召喚する事もできる。<br>(1)：墓地へ送られるカードは墓地へは行かず除外される。<br>(2)：カードが除外される度に発動する（同一チェーン上では１度まで）。<br>除外されているカード１枚を選んでこのカードのＸ素材とする。<br>(3)：お互いのターンに１度、このカードのＸ素材を３つ取り除き、<br>フィールドのカード１枚を対象として発動できる。<br>そのカードを裏側表示で除外する。</blockquote><br>　注目してほしい効果は(2)だ、ここで改めて天気の効果発動条件を見てみよう。<br><blockquote>●このカードを除外して発動できる。</blockquote>おしめぇだろ。<br><br>　これがどういうことかというと効果を発動するたびに天気モンスターがアライズハートのX素材として吸収されてしまうわけだ。<br>一時的に除外し、次のターン帰ってくることで長期的なコストを0にするのが天気の動きなのだが、吸収されることでその帰還が出来なくなってしまう。<br>しかも最悪なことにこのクシャトリラ、すでに遊戯王OCGの方で最強の一角ということが証明されており強さを求める大多数の決闘者が使う事が目に見えている。<br>つまり哀れかわいらしい天気モンスターたちは効果を発動するのたびに終わりのないX素材への旅へと向かってしまうことになる。<br>こんな惨状では天気デッキでゲーム内最高ランクに行くのは到底無理だ。幼天気が終わり、われわれ天気使いは強さを得るため新しいデッキに乗り換えなければいけないのだ……<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\">アライズハートなぞ！知った！ことか！ボケカスがぁ！！！！<br>ッッシャア！！！！！！！！ <a href=\"https://t.co/M7NFjVto7x\">pic.twitter.com/M7NFjVto7x</a></p>&mdash; ctc (@cure_to_coma) <a href=\"https://twitter.com/cure_to_coma/status/1712392526391361953?ref_src=twsrc%5Etfw\">October 12, 2023</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> <br>んなわけねぇだろうがよぉ！アライズハート何するものぞ天気最強！！Fuck yeah！！！<br>ということで天気で今シーズン、大挙するクシャトリラ軍団を押しのけて無事にマスター1にたどり着けたので色々語りたい。<br>ここまでは遊戯王を知らない人にもわかりやすいように専門的な語句や概念をなるべく使わないように試みていたがこの先はどんどん使わせていただく。<br><br>上述の天気デッキが他のデッキに比べて弱いというのはまごうことない事実である。<br>恐らくMDが始まって以来天気が環境にいた瞬間は一瞬たりともない、かろうじてティアラ全盛期にマクロ裂け目アトラクターが使えるデッキという一点でT3ぐらいに滑り込んでいたころぐらいか。天気ミラーが発生したのは後にも先にもあの環境だけだった。<br>しかしその一方で恐らく天気予報が実装されて以降天気がマスター1に至れない環境は一切なかったとも思われる、その理由が採用できるメタカードの幅広さだ。<br>上述の99%のデッキを機能停止させるスキルドレインをはじめマクロコスモスに闇光ミラー、魔封じのツボに群雄割拠とおおよそありとあらゆるメタカードが積めるた大抵の環境には何か刺さるものを見つけられる。<br>ならなぜ今シーズン天気使いが嘆いていたかというと上記のアライズハートに加えありとあらゆるメタカードを一人で処理してくれるクシャトリラ・フェンリルの存在によるところが大きい。<br>大半のメタカードは相手に1行動だけなら許してしまう、フェンリルはその1行動を使い確実に最も鬱陶しいであろうパーツを処理してくるのだ。そのため今まで主流であったメタビ型天気には逆風が吹き、新たな軸を考える必要が出てきた。<br><br>しかし幸運なことに環境はほぼクシャトリラ一色といっていい状態で天気が非常に苦手なフリチェのサクエスを縛ってくるラビュリンスや2つしかない手数を両方ふっ飛ばしてくるピュアリィはほとんど見かけられないようになっていた。<br>つまりメタカードを抜いて余ったスペースにクシャトリラ対策を詰め込めばどうとでもなるというわけだ。<br>墓地利用の禁止が致命傷であったティアラと同様にクシャトリラにも「テーマ内に無効化効果が一切ない」という致命傷を抱えていたためこちらからすればその点を突けば容易に崩せる。<br>また環境初期だったのもあって練度が低いのも幸いした、終盤ではバロネスや未来龍皇を立ててのケアも見かけるようになっていたのでそれらでニビルケアをされるようになってた場合ヴェーラー投入の必要もあったかもしれない。<br>それ以外だと天気の元々備えている誘発受けの良さがいつも以上に相手にセルフハンデスを強いれたことも良かった。<br>特にクシャによく効く為に投入されているドロバと抱影とヴェーラーとニビルは全く効かないので結構な誘発を腐らせることができただろう。<br><br><img class=\"float\" src=\"../../assets/Images/Photos/Blog/WeatherDeck2023Oct.jpg\">それではデッキの解説の方に移らさせていただきたい、まずはメインデッキ：<br>《雪天気シエル》x3<br>《曇天気スレット》x3<br>《雷天気ターメル》x3<br>《雪の天気模様》x3<br>《天気予報》x3<br>こいつらを3枚積まないと天気デッキは始まらない。烙印の規制とともに復烙印を見かけなくなったのでターメルは3枚でいいだろう。<br><br>《雨の天気模様》x1<br>《雷の天気模様》x1<br>《曇の天気模様》x1<br>《虹の天気模様》x1<br>ピン指しの天気模様たち、雷と雨は必須と考えていいが重ね引きが酷く弱いので一枚ずつの採用で。<br>曇はクシャからアルシエルを守るために重要度が急激に上がった、場合によっては雷よりも強い。スキドレ下のスケクシャを突破するのにも役立つ。<br>虹は素引きが本当にゴミなので入れたくないが後攻で天気予報から出せないと詰む盤面が多いので入れざるを得ない、盤面にモンスターを維持しつつのフリチェ逃亡は本当に場合によっては便利。<br><br>《強欲で金満な壺》x1<br>《金満で謙虚な壺》x1<br>ドロソ達、強金は重ね引きした時に頭がおかしくなるので1枚で。<br>金謙は制限じゃなければ3枚入れで死ぬ気でスキドレを引きに行きたかった、どうせワンキルできないのでデメリットはないものと考えても良い。<br><br>《灰流うらら》x2<br>《増殖するG》x2<br>ロキナさんの重ね引きした時が最悪なので2枚に減らしたら案外うまくいったという話を聞いて試したらしっくり来たので2積み。<br>天気で何か気になることがあったらロキナさんの動画を見れば大体解決するのですごい、動画の小芝居も子気味よいのでオススメだ。<br>Gはスタンバイγやビタ止まりの裏目がデカすぎるのでしっかり発動確認をするように、どうせ天気のEXに抜かれて困るカードなんてアーゼウスしかいないしユニコーンケアは不要。<br><br>《無限泡影》x3<br>ターン1がないので3積み、2枚も引ければ実質スキドレと考えても良い。クシャモンスターを起動しないのも優秀。<br><br>《幽鬼うさぎ》x3<br>永続から動くデッキが多すぎるので3積み、バースとマイフレンドを砕くのが主な仕事だがちょいちょい他の物体も砕いてくれる。<br><br>《ハリケーン》x1<br>多分このデッキで一番変なカード、一回使われて感銘を受けたので入れてみたらこれが働くこと働くこと。<br>伏せても普通に使えるし罠なのでクシャを起動しないしですごく便利、デッキスペースがないのでピン指しだがみなさんにも是非お勧めしてみたい。<br><br>《原始生命態ニビル》x3<br>クシャが無駄に展開力を得たので雑に蹴散らせる今シーズンの最強カード。<br>天気のフリチェ回避は自分の全体除去もしっかり避けられるため先攻でも腐らないのが壊獣と違う利点。<br>通せば大体勝てるので事故の事を考えても3枚積みたかった。<br><br>《サンダーボルト》x2<br>《ハーピィの羽根帚》x1<br>雑に強い捲り札たち、サンボルは言わずもがな羽根帚はリソース回復を阻害できるのでとどめの一発としてバカにならない。<br><br>《群雄割拠》x1<br>クシャにはさほど効かないがアーゼウスや壊獣の対策もできるのでとりあえず入れておきたい一枚。<br>アライズハートを雑に処理できるので後攻でも便利。<br><br>《スキルドレイン》x1<br>言わずもがなの天気との相性最高な最強永続罠、3枚積ませてほしい。<br><br>続いてEXデッキ：<br>《虹天気アルシエル》x3<br>《月天気アルシエル》x3<br>とりあえず3積み。月の一時除外はスプラやXYZデッキ相手だと案外馬鹿にならない、特に対ピュアリィだとそこそこ肥えたデブを処理できるので面白いが抱影で詰むのでやっぱり基本は虹天気。<br>相手が天気を知らない様だったら普通に無効を飛ばせばいいが知ってるようなクシャ相手だった場合リリース効果で着地狩りもアリかもしれない、特に曇模様を用意できてない場合は。<br><br>《幻影騎士団ブレイクソード》x1<br>《No.75 惑乱のゴシップ・シャドー》x1<br>《ダウナード・マジシャン》x1<br>《天霆號アーゼウス》x1<br>アーゼウスで全体除去を飛ばすための方々。意外かもしれないが天気は3枚要求するとはいえモンスター効果を一切発動せずにアーゼウスまで繋げられるためクシャ対策アーゼウスの運用は得意な方だったりする。<br><br>《共命の翼ガルーラ》x1<br>《旧神ヌトス》x2<br>時々見かけたドラグマ対策、EXデッキスペース余ってるので入れておいて損はない。<br>ドラグマ出張セットはアルシエルを使う都合上入れるのは無理だった、命削りや強謙も同様。<br><br>《アクセスコード・トーカー》x1<br>たまに打点が必要な時に使う、天気はモンスター0枚から月天気→アクセスと繋げられるのでリソースの事はあまり考えなくてもいい。<br><br>《閉ザサレシ世界ノ冥神》x1<br>詰み防止、一回も使わなかった。<br><br>マスター5まではクシャ前の環境だったのでオーロラの天気模様というサーチ殺しを導入していたがクシャ後には素引きが重すぎて消失した。<br>同じくγも手札一枚一枚の価値が大きい天気だとドライバー素引き事故が痛すぎて途中から抜けた、盤面が空になってクシャが再展開できるのもキツい。<br>ベンガーラは汎用に少しでもスペースを割きたかったのと墓地復活を使える機会がないので抜けた。<br><br>最後に回し方だがピン指しが多すぎてあまり再現性はないが天気の動きとしては基本的に雪＋何かを常時構えてマスカンを潰していく形になる。<br>アルシエルがいない場合は雪＋雨、いる場合は雪＋雷OR曇で雷の場合相手がなめてるクシャなら効果使用時に無効破壊、舐めてないなら着地狩りした後スレットで墓地の雨を回収してそれでマスカンを狙う形になる。<br>あとは相手のデッキの効果をよく読んで通してもいいカードを通しつつ誘発も交えてマスカンを潰すだけだ。<br>後攻の時はとにかくブラフを撒き無効を無駄遣いさせつつアーゼウスかスキドレか群雄を通したい。<br>幸運にもソロモードがあるにもかかわらず天気の知名度は皆無といっていいので案外何とかなる。本当に知名度がない、今だに天気予報が異常な優先度で除去されていく。<br><br>とまぁこんな風に自分はこれでマスター1に到達することができた、参考になるかはわからないがもしなってくれたら嬉しい。<br>相手の練度や運にも助けられたがそれでも好きなデッキでマスター1に到達できる喜びは何にも代えられないものだ。<br>幼天気は終わっても天気は終わらない、環境に合わせて形を変えていくだけだ。",
    "tags": [
      "遊戯王"
    ]
  },
  {
    "id": 5,
    "date": "8/26/2023",
    "title": "SABUN in the DARK振り返り",
    "content": "　SABUN in the DARKお疲れさまでした、というわけでSo Long and Thanks for All the Notesという名義でLN譜面2個投げさせていただきましたctcです。So Long and Thanks for All the Notesという名義銀河ヒッチハイク・ガイド4冊目である「さようなら、いままで魚をありがとう」の原題、\"So Long, and Thanks for All the Fish\"の捩りである。の明智小衣ことルナ・ヴィオーラ氏による邦題と全く同名BMSが存在するのでタイトルだけは知っているという方も多いだろう。Long Notesという譜面傾向を内包していることも個人的に気に入っている。<br><br>　まずはBLUE SCREAM[LN]について、コンセプトはZindyの赤ちゃん。予想を難しくする点としてそもそもLN譜面を最後に作ったのが恐らく10年ほど前の◆スト以来という点だろうか。他にLN譜面を頻繁に作る人が参加していなかったためそこまで難易度を上げているわけではないと思うが手癖という発言がちょっとミスリードになってしまっていたかもしれない。配置自体は隣接が少なめだったり音階通りの配置が多いなどは普段の自分の譜面と同様だが、キメのZindy階段の音階無視やキックの位置をころころ変えるのはあまりやらないタイプの配置なため、これらも譜面の印象を自分から遠ざける事に寄与してしまっていたかもしれない。一方で自分のツイッターを追っていないとわからないことだが、自分は穴抜きがかなり苦手なため穴抜き地帯が時間差やZindy配置よりも圧倒的に簡単であることはヒントになったかもしれない。譜面自体の完成度は個人的に満足いっているが一つだけ、9個ある無音ノーツのうち二つでリズムをミスっているのだけは本当に恥ずかしかった。普段無音をあまり置かない弊害が出てしまった。他人からの評価もインプレやパブサを見る限り良好なのは嬉しかった。プレイ、インプレ本当にありがとうございます。<br><br>　さてGray boxの譜面に行く前にBlack boxの譜面について大まかに触れていきたい。何を言っても自分がどれを作ったかに繋がってしまいそうでインプレをするのは避けていたが色々話したいことはある。<ul><li>≡4 hinadelic -さでぃすむ-<br>とんでもない詐称ではあるが横に広い連打自体は押していてすごく楽しい。orajaのハード逃げなら恐らく難易度は適切かもしれない。</li><li>★??? Booboo Bounce! [強盗譜面]<br>結構自分だと思われていた譜面、数字通りの配置は好きだが突然のミラー配置とトリル後に猶予の厳しい即死地雷があるのは自分では置かないと思う。</li><li>★13 Battle TechniX -bionic-<br>とんでもない詐称その2。音に忠実な連打やキメの幅広い同時は好き。正規以外をとりあえず殺す3隣接の壁も意志が強く感じられて好きなので本当に難易度だけは上げてほしかった。</li><li>fr2 Hanky-Panky!!<br>同時押しは2個までというコンセプトが同音連打の多くメロディの展開が少ないロッテルダムテクノと合っていた。同じ鍵盤を両手で交互に連打させる想定の16分も好き。ただコンセプト先行すぎて予想は無理。</li><li>fr11 天使ぬがよい<br>とんでもない詐称その3。宮子の魔女差分が発表された直後、曲変更というワードに期待が高まってたところにこれをお出しされた衝撃はすごかった。これを自分が作ったと予想されたのは結構ショック。</li><li>sl1 Oekaki [SP Drawing]<br>隣接少な目の音階に忠実な配置がすごく優れて感じた。トリルやLNの仕込み方もお洒落。</li><li>sl1 Paracelestia [Advanced]<br>これまた低難易度の隣接少な目で音階に忠実な優等生譜面。爽快感のある曲に押しやすい譜面がマッチしている。</li><li>sl4 Coquelicot [Spring]<br>自由な配置の同時主体の譜面、音階無視はあまり好みではないがアクセント的に差し込まれる皿は好き。自分はKBだからいいが後半のLN+皿がかなり厄介に感じる人もいるかも。</li><li>sl6 CUTE-Mythology (ふわふわ)<br>細かい階段の使い方と要所要所に仕込まれる連打でいい感じにキャラが立っている。メリハリの付け方も好み。</li><li>sl6 Reallicious [Spaghettified]<br>このイベントは正規当たりの譜面が多いのだがそれをひときわ強く感じさせられる譜面、隣接の配置の思い切りが良すぎるし押しててとんでもなく楽しい。</li><li>sl8 Oekaki [Hekiga]<br>難しい方のOekaki、同時の個数が多さや細かいリズムの配置などが★22Altaleの体験版のような印象を与える。</li><li>sl11 Aloof Wolf -Loafer-<br>とんでもない詐称その4。声に合わせた連打の配置はカッコいいし基本ランダムで声ネタで一瞬1になるBPMの演出やLNにこの低BPMから繰り出されるガクガクギミックもいい意味で印象に残る。なんで詐称なんだ。</li><li>sl12 Sousyou Soukoku [Vanitas vanitatum]<br>とにかくトリルのインパクトがとんでもない。トリルの間に声ネタを挟むの面白いんだけど全然押せなくて最高。</li><li>st0 βehexeη‐δ [Fragments]<br>LNの使い方から小節線の演出に綺麗な階段と何から何まで面白すぎる譜面。いや本当に楽しいんですよこれどう考えてもStella的じゃないけど。</li><li>st1 Luna Express 2032 [Star Rail]<br>ディレイが苦手な自分でも楽しめる凄く易しいディレイ譜面、階段主体で正規が押しやすいのと連打多めで練習になる気もする。</li><li>st4 Oriental Landscape [Pleinair]<br>軽めのトータルで回復と暴力的な連打を交互にやらせてくる譜面だが配置が絶妙で以外と立て直しにくい。逆餡蜜大前提の連打が攻略し甲斐があって好き。</li><li>st4 THE SEVEN ·······<br>正直楽曲の同梱譜面が好きすぎて差分を作ること自体が若干解釈違いなのだが配置自体はすごく好み。小休止を挟む局所発狂の繰り返しでしっかりと譜面全部を押さないといけない構成が巧み。惜しいところまで行けたのでそのうちクリアしたい。</li><li>st5 WHATEVER -Decimation-<br>あまりにもStella的なガチ押し。自分はあまりこういう機械的な配置は好みではないのだが無機質な曲調にはあってると思う。あと中盤のトリル絡みの配置もいい感じ。</li><li>st5 ◆ B a r o q u e ◆ PAR<br>割と狭めのガチ押しが結構曲にあっている、同色が多い見た目の割に正規が意外と押しやすくクリアしたくなるいい譜面。</li></ul><br>　他人の譜面に対する簡単な感想は上記のような感じとなる。そしてBlack boxが終了して他人の予想がどのように振り分けられているのか公開されたのだがわりと手癖で作っていたつもりだったが正答率が結構高かったものの自分の望むほど高くなかったためGray boxではもう自己紹介のような譜面を作ってしまおうと決めて作ったのがEvanescent[LN]だ。本来は上で言及した「さようなら、いままで魚をありがとう」の続編である「ほとんど無害」というBMSで作ろうとしていたのだが、音切りがあまりにも差分作成に向いていなかったためにその計画は頓挫してしまった。本当に差分作成に向いていないので時間がある人はぜひ中身を見て見てほしい。そこでギミックもLNも仕込みやすい曲調を探し白羽の矢が立ったのがEvanescentだった。BLUE SCREAMをクリアできなかった人が多かったのを踏まえ難易度は抑えめに、初見でも十分捌ける程度の軽いギミックとを追加して音の長さに忠実なLN譜面に仕上がった。ギミック以外で個性があまり出せずプレイ中の気持ちよさがあまり感じられなかったため大満足とはいいがたいが手堅く仕上がったと思っている。<br><br>　そんな譜面で参加したGray boxの他人の譜面についても触れていきたい。Black boxに比べて平均難易度が上がっているためコメントの曖昧さが増すのはご了承いただきたい。<ul><li>◆11 Wings Of Silence [Memory]<br>LN譜面を作る人が自分以外にも出てきてしまった。やはり生音系の曲にはLNが似合う。芸術的な配置も多く押しやすくすごく楽しい。乱で著しく難易度が下がる点は好きだが個人差がありそう。</li><li>★16 Strangulation -freakout-<br>Battle TechniXもそうだが人類の連打力に対する期待がとんでもない。音にあった連打や皿は楽しいが難易度がとてつもなさ過ぎて笑うしかない。譜面自体は楽しい。</li><li>fr11 量産型八咫烏[台パン]<br>親に向かってなんだその台パンは。BPM266の16分連打は人間には無理だと思う。ラストのおまけでひと笑い持ってかれたのが悔しい。</li><li>sl0 WAYLAID [強盗譜面]<br>この難易度帯ではめったに見ない個数の同時押しが強烈な譜面。後半からは連打も絡みプレイ感が凄く独特だった。</li><li>sl5 scualee [et omnia vanitas]<br>細かいリズムの置き方とキメの連打が曲への没入感を生み出していてすごく楽しい、小螺旋に偽装した連打が小賢しくてとても好み。</li><li>sl5 妖々跋扈 (ほやほや)<br>曲が乱打を作れと言っているようなものなのでそれに忠実な乱打を基本に要所要所に入る連打が楽しい。drrrrの配置が個性的に感じる。</li><li>sl6 CG [↑Cut,Gravity↓] -かおしずむ-<br>ハネリズムに由来するこの難易度帯では速い連打が印象的だった。隣接の多さも相まって★22のUnder the sunshineをマイルドにしたような感覚を覚える。</li><li>sl9 bibital orbital [straying]<br>Black boxに引き続き正規の当たり度合いが強烈。長く押しやすい速度の連打がとても楽しい。ラスト前の桂馬デニム隣接をころころ切り替える物量も地味に好き。</li><li>sl11 Sesame Kingdom [Sesame Street]<br>複合リズムをしっかりおいていてすごくスコア難を感じる物量譜面。このイベントにしては珍しく割れ譜面が大当たり。そのうちslに入りそうに感じた。</li><li>sl12 CO5M1C R4ILR0AD -5T4R R4IL-<br>めちゃくちゃ楽しいのにハードできなくて泣いてる、絶対倒したい。ラスト発狂の出口は5回ぐらい見えた。</li><li>sl12 Rainforest [Squall]<br>曲のキレイ場部分では綺麗な配置を、不安定な部分では癖の強い配置が置かれていて曲と譜面の一体感がある。最新イベントからHOTな選曲をしているTrancerさんの姿勢は個人的に応援したい。</li><li>st1 Strahv -AAA-<br>非常に珍しく感じる高難易度の普通の物量譜面。前半は細かいリズムが多いが後半に行くにつれてどんどん素直になっていき解放感がある。</li><li>st2 Unexpected rewind -loather-<br>曲にあった4連打はスタイリッシュだが難易度がとんでもない。逆餡蜜は下手なのでst4か5ぐらいあるように感じてしまう。BPM演出は引き続きオシャレで好き。</li><li>st3 Bird Sprite -D.K.R. mix- (24maniaq)<br>差分名通り24分ディレイを延々やらせてくる死ぬほど苦手なタイプの譜面。blacktrainさんの仮装的な構成なせいで予想が非常に難航した。</li><li>st4 Re:End of a Dream [Nightmare]<br>細かい連打がとにかく強烈な譜面、トータルは高いがそれを帳消しにするほどの暴力性が清々しかった。</li><li>st4 A.U.M. [Emrit]<br>曲にあったガチ押しだとは思うがちょっと難しすぎて何も言えない、st7ぐらいはあるのではなかろうか。</li><li>st6 amorphous -disordered-<br>BPMの遅さを細かいリズムでカバーして強引に重発狂をさせてくるスタイルが珍しく感じた。クリアはできないがかなり好み。</li><li>st6 Quadrupolar ::<br>親に向かってなんだその物量は。自分でもいつかこの曲の物量譜面を遊びたいと思っていたが凄くいい感じのものをいただいてホクホク。ラス殺しが多少過酷だがそれでも挑戦心をくすぐられるいい譜面だと思う。</li><li>st10 クォークの海を泳いで ALTERNATIVE UNIVERSE<br>この速度で折り返し多めの階段はマジでヤバいと思う。</li></ul><br>　個人的な感想としては以上だ、ルールを勘違いしていたせいで申し訳ないがSand boxの譜面についての感想はない。全体を通して感じたのが正規当たりの多さだろうか、全体的に楽しい譜面が多かったので参加できて非常に良かった。もしまた機会があれば是非参加したい。予想に関してはほっといてほしい、自分は推理に向いてないのだ。",
    "tags": [
      "BMS"
    ]
  },
  {
    "id": 4,
    "date": "7/21/2023",
    "title": "無限に広がる大宇宙以外の全て",
    "content": "　大学生の頃に哲学の授業を取っていた時、思いついて気に入り人に話したら強く否定されて凹んだ記憶のある理論がある。理論といっても根拠も何もない理論と呼ぶのも烏滸がましいものだが。宇宙の誕生についての予想は幅広く信じられているビッグバン理論があるが、その一方で宇宙の外側についての話は殆ど進んでいない。それは当然観測が不可能だからだ。ビッグバン理論が支持されているのも観測的証拠が存在するからであり、宇宙の外側については何も観測できていない。（観測できていたらそれも宇宙として扱われるであろう）よって宇宙の外側についてはどう頑張っても与太話にしかならない、否定されたのもそれが理由であろう。そのことを念頭に置いて話を聞いてほしい。<br><br>　前置きが長くなってしまったが、何が言いたいかというと宇宙の外側は「有」っで埋め尽くされているのではないのかという予想だ。ゲームで使われる物理エンジンシミュレーターで物体が重複した際、片方が理外の速度で射出される現象を見たことのある人間は多いであろう。この理論はビッグバンの発生した原因がその無限に広がる「有」が歪みで重複してしまい、その重複を解決する際に片方をエネルギーに変換してそれが爆発を引き起こしたという妄想に基づいている。今はまだ原初の爆発の余波で宇宙は膨張しているがやがて外側の「有」の圧力に宇宙は押しつぶされて縮み、最終的にビッグクランチを引き起こす。そしてそのビッグクランチの際勢い余った物質が再度重複してより大きなビッグバンを引き起こし次の宇宙に繋がる。そんな妄想だ。<br><br>　この予想が正しければ恐らくこの宇宙の爆発の余波で他所の「有」も歪みそちらでも宇宙が発生しているであろう。このプロセスが繰り返されればやがて別々の宇宙が接続することもあるはずだ。その時にそれぞれの宇宙の真空の密度の違いで物理法則が狂い散らかすのも面白い。そんな感じの事を考えはするものの証拠も何もないのでこういうブログの記事にするぐらいしか出来ない。<br>嗚呼哀しきかな1,300mL内にしか存在しない無限の宇宙論。",
    "tags": [
      "閑話"
    ]
  },
  {
    "id": 3,
    "date": "7/2/2023",
    "title": "自縛",
    "content": "　自分は自由度が高い環境に置かれると選択肢を選ぶのに苦労する。ある程度縛りを課せられている方がその範疇での最善を見つけることをモチベーションに動きやすい。ただし困ったことにそういった環境を快適に感じてしまうため時々無意味に自分自身で縛りを設けてはそれに囚われ続けてしまうということがある。<br><br>　過去には自作BMSでH譜面を毎回☆10で作っていたことがそれに該当する。幸運にも前作からかなりの時間が空いたCreeping Tone Clustersでその呪縛からは逃れられたがもう一つ自覚的である公言していない縛りについてはもう少し解決までかかりそうだ。<br><br>　解決する方法なのだが自分の自覚的な限りでは三つある。まず一つ目にだが長い時間その縛りを強制される状態から離れることによって縛り自体を忘れ思い出す頃には自然に破っているというもの。こういう縛りに囚われる理由に関しては自分の完璧主義者的な部分が悪さしているように感じるので完璧でなくしてしまえば簡単に逃れられる。上記の☆10縛りも記憶から薄れてどうでもよくなったタイミングで破れた。<br><br>　二つ目は外部から縛りのデメリットについて滾々と語られ説き伏せられること。正直この脱却法は小さなものとはいえ信念を否定される行為なのであまり愉快ではない、が冷静に考えて無意味に可能性を狭めているのだからなにか言われるのもやむなしだろうし感謝はすれど怒る理由はない。ないのでなおさらモヤモヤが溜まってしまうのだが。<br><br>　そして最後の脱却法は最も理想的なものであると感じるのだがその縛りを破ってでも表現したいものが現れた時だ。上記の公言していない縛りについてだがこの方法で破るめどが立ったのでそれが公開できる日が待ち遠しい。自分のやる気が溜まるまでの遅さを考えるとしばらくかかりそうなのが悲しいところではあるが。",
    "tags": [
      "閑話"
    ]
  },
  {
    "id": 2,
    "date": "6/23/2023",
    "title": "公開",
    "content": "　ついに自分も電脳世界で一国一城の主となったわけだ、完成まで2年ぐらいかかってしまったのでとても感慨深い。どうしてこうも時間がかかったのかというとひとえに自分の怠惰が原因であるのだが。とりあえず軽くページ案内をさせていただきたい、これはトップページでやるべきことではないのか？という点についてはひとまず置いておく。書いておけば後々流用もできるだろう。<br><br>　まずはトップページだが自己紹介とツイッター、及び更新情報が設置してある。現在は以前貰ったイラストを許可を得たうえで設置してあるがそのうち自画像にでも差し替える予定だ。ツイッターは処理の関係でロードが終わる前にページに表示されるのが気に食わないが穴埋めとしては上出来だろう。ツイッター事態に対する好感度が近年ガンガン下がっているのでそのうち消えるかもしれないが。更新情報についてはまさに文字通り更新情報を乗せているだけ。RSSを実装しようかと考えもしたが自分で使ったことがないのもあって気が乗らなかったので未実装だ、もし誰かが要求したら追加する。<br><br>　BMSページは自作のBMSがコメントと一緒に紹介されている。ジャケットをクリックすると実装が一番面倒だったモーダルウインドウに情報が表示される仕組みだ。音を流そうと考えもしたが自分がそういうのっでびっくりするタイプなので一旦保留している。また左上のDLリンクでは一括でダウンロードも可能なのでクリック回数を減らしてBMSだけ手に入れたいに人にも親切な仕組みになっていると思う。Sky Skimmingは合作相手の許可が取れていないので未追加、RSE四天王と浪漫電脳進行系は著作権が怖いのでないがそのうちこっそり追加すると思う。<br><br>　差分ページは自作差分が全て難易度表形式で管理されている。旧ブログと比べると情報量が減ったがサッパリしたので一長一短か。https://ctconnected.net/sabun と入力することでGLAssistにも対応している<br><br>　そしてこのブログページだがいたって普通のブログだ。コメント欄を設置していないのはセキュリティ的な観点から自分が管理できるとは到底思っていないことが理由。安全な実装自体はCloudflareなどを使えば容易だが、結構な金がかかるうえに旧ブログでもあまりコメントをもらった記憶がないので不要と断じた。<br><br>　ツールページは作ったはいいものの大したものもないしスペース埋めぐらいしか出来ていない気がする。<br><br>　そして最後にリンク集、こちらもナビゲーションバーの情報量増やすぐらいにしかなってない気がする。もしバナーとかあったら追加したいのだがこの現代サイトバナーを持っている人間などほぼいないと思われる。かくいう自分も持っていない。<br><br>　サイトについては大まかにこんな感じだろうか。使われているテクノロジーなども説明したかったが思ったよりも長くなってしまったのでまたの機会にする。",
    "tags": [
      "閑話"
    ]
  },
  {
    "id": 1,
    "date": "6/19/2023",
    "title": "動機",
    "content": "　日々を生きているとふと任意の概念に対してつらつらと長文を書き連ねたくなることがある。例えば調理中トマトを切る際、あらゆる包丁研ぎ機の通販でトマトが切られていることについてとか。 そういったアイデアが浮かんでは消え浮かんでは消えているのだが、それらを出力してみたくなったのだ。脳内ではそれらのトピックについて無限に続けられるように思えるのだが、実際に文字に起こした場合どれくらい文章を連ねられるかという問いに対する答えが欲しいというのもある。<br><br>　そういった乱雑な書き連ね以外の記事としては趣味であるゲームに関する攻略や雑談といったトピックが主となるか。ツイッターなどではBMS関連のフォロワーがほとんどであることから、それ以外のゲームの話題は割と控えめにしがちであるのでその捌け口としても利用していきたいと思う。読んだ本や見た映画について語るのもありかもしれない。ネタバレを嫌悪する類の人間なので自分からネタバレを発することもしないように試みているのだが、その結果感想などをシェアする機会があまりない。ブログならネタバレ除けも設置しやすいであろうしいい案かもしれない。<br><br>　また別の理由として自分の日本語で長文を能力を少しでも鍛えたかったということもある。自分は現代人らしくSNS中毒に陥っており、140文字以上の文章を書いた覚えがさらさらない。英語でなら日々つけている日記や、それでこそ仕事や大学では各種課題やプロジェクト、論文でかしこまった文章を書き連ねていたため経験があるが、日本語での文章に関してはさっぱりだ。インターネットの良くない部分に入り浸っていたため語彙や文の構成などといった能力にも乏しいのでそれらを改善したい。<br><br>　ただしブログを書くといっても自分は自身の感情や意見を公開することに関して酷く臆病なため、おそらくひどくどうでもいい話しかしないように試みるであろう。というわけで自身のブログを暮狛閑話と名づけることとした。閑話休題してまた閑話。願わくば三日坊主にならないことを祈るが、ならなかったところで更新頻度には期待できないであろう。",
    "tags": [
      "閑話"
    ]
  }
]
